---
kind: method
id: M:Autodesk.Revit.DB.OffsetSurface.GetBasisSurface
source: html/5fb55047-9bf3-aa08-a0f6-695916946c30.htm
---
# Autodesk.Revit.DB.OffsetSurface.GetBasisSurface Method

Returns a copy of basis surface of this OffsetSurface.

## Syntax (C#)
```csharp
public Surface GetBasisSurface()
```

## Returns
Basis surface of this OffsetSurface.